# Reversão da Transformação e Diferenciação

In [1]:
import numpy as np
import pandas as pd

In [2]:
dados = pd.read_csv('AirPassengers.csv', sep=',')
dados.head()

     Month  #Passengers
0  1949-01          112
1  1949-02          118
2  1949-03          132
3  1949-04          129
4  1949-05          121

In [6]:
serie = pd.Series(dados['#Passengers'].values, index = dados['Month'])
serie

Month
1949-01    112
1949-02    118
1949-03    132
1949-04    129
1949-05    121
          ...
1960-08    606
1960-09    508
1960-10    461
1960-11    390
1960-12    432
Length: 144, dtype: int64

# Transformação

## Reversão da Transformação por Logaritmo

In [4]:
# transformação por log (este log é logaritmo natural, tem base e)
serie2 = np.log(serie)
serie2

Month
1949-01    4.718499
1949-02    4.770685
1949-03    4.882802
1949-04    4.859812
1949-05    4.795791
             ...
1960-08    6.406880
1960-09    6.230481
1960-10    6.133398
1960-11    5.966147
1960-12    6.068426
Length: 144, dtype: float64

In [7]:
# revertendo a transformação log
serie_revertida = np.e**serie2 # e elevado a serie2
serie_revertida

Month
1949-01    112.0
1949-02    118.0
1949-03    132.0
1949-04    129.0
1949-05    121.0
           ...
1960-08    606.0
1960-09    508.0
1960-10    461.0
1960-11    390.0
1960-12    432.0
Length: 144, dtype: float64

In [8]:
# transformação por log, agora por base 10
serie2 = np.log10(serie)
serie2

Month
1949-01    2.049218
1949-02    2.071882
1949-03    2.120574
1949-04    2.110590
1949-05    2.082785
             ...
1960-08    2.782473
1960-09    2.705864
1960-10    2.663701
1960-11    2.591065
1960-12    2.635484
Length: 144, dtype: float64

In [9]:
# reversão da transformação log 10
serie_revertida = 10**serie2
serie_revertida

Month
1949-01    112.0
1949-02    118.0
1949-03    132.0
1949-04    129.0
1949-05    121.0
           ...
1960-08    606.0
1960-09    508.0
1960-10    461.0
1960-11    390.0
1960-12    432.0
Length: 144, dtype: float64

## Reversão da Transformação por Raiz Cúbica

In [10]:
#  transformação p raiz cúbica (quando possui valores com zero ou negativo)
serie3 = (serie)**(1/3)
serie3

Month
1949-01    4.820285
1949-02    4.904868
1949-03    5.091643
1949-04    5.052774
1949-05    4.946087
             ...
1960-08    8.462348
1960-09    7.979112
1960-10    7.725032
1960-11    7.306144
1960-12    7.559526
Length: 144, dtype: float64

In [11]:
serie_revertida = serie3**3
serie_revertida

Month
1949-01    112.0
1949-02    118.0
1949-03    132.0
1949-04    129.0
1949-05    121.0
           ...
1960-08    606.0
1960-09    508.0
1960-10    461.0
1960-11    390.0
1960-12    432.0
Length: 144, dtype: float64

# Diferenciação

## Reversão da Diferenciação

In [12]:
serie_diferenciada = serie.diff() # lembrando que na diferenciação perdemos o primeiro valor, já que ele não tem um valor antecessor
serie_diferenciada

Month
1949-01     NaN
1949-02     6.0
1949-03    14.0
1949-04    -3.0
1949-05    -8.0
           ...
1960-08   -16.0
1960-09   -98.0
1960-10   -47.0
1960-11   -71.0
1960-12    42.0
Length: 144, dtype: float64

In [13]:
serie_revertida = serie.shift(1) + serie_diferenciada
serie_revertida # mesmo assim, perdmeo so primeiro valor

Month
1949-01      NaN
1949-02    118.0
1949-03    132.0
1949-04    129.0
1949-05    121.0
           ...
1960-08    606.0
1960-09    508.0
1960-10    461.0
1960-11    390.0
1960-12    432.0
Length: 144, dtype: float64

#### Organizando num dataframe

In [14]:
# fazendo a diferenciação dos valores que estão na coluna '#Passengers' e criando uma coluna no dataframe com o nome 'valores_diferenciados'
dados['valores_diferenciados'] = dados['#Passengers'].diff()
dados.head()

     Month  #Passengers  valores_diferenciados
0  1949-01          112                    NaN
1  1949-02          118                    6.0
2  1949-03          132                   14.0
3  1949-04          129                   -3.0
4  1949-05          121                   -8.0

In [15]:
# fazendo a diferenciação dos valores que estão na coluna 'valores_diferenciados' e criando uma coluna no dataframe com o nome 'valores_revertidos'
dados['valores_revertidos'] = dados['#Passengers'].shift(1) + dados['valores_diferenciados']
dados.head()

     Month  #Passengers  valores_diferenciados  valores_revertidos
0  1949-01          112                    NaN                 NaN
1  1949-02          118                    6.0               118.0
2  1949-03          132                   14.0               132.0
3  1949-04          129                   -3.0               129.0
4  1949-05          121                   -8.0               121.0